{
	"items": [
		{
			"id": 0,
			"title": "Bubble sort",
			"subtitle": "Comparison sort",
			"description": "Bubble sort algorithm starts by comparing the first two elements of an array and swapping if necessary, i.e., if you want to sort the elements of array in ascending order and if the first element is greater than second then, you need to swap the elements but, if the first element is smaller than second, you mustn't swap the element. Then, again second and third elements are compared and swapped if it is necessary and this process go on until last and second last element is compared and swapped. This completes the first step of bubble sort. If there are n elements to be sorted then, the process mentioned above should be repeated n-1 times to get required result. But, for better performance, in second step, last and second last elements are not compared becuase, the proper element is automatically placed at last after first step. Similarly, in third step, last and second last and second last and third last elements are not compared and so on. A figure is worth a thousand words so, acknowledge this figure for better understanding of bubble sort.",
			"code": {
				"data": "import java.util.Scanner;\r\n \r\nclass BubbleSort {\r\n  public static void main(String []args) {\r\n    int n, c, d, swap;\r\n    Scanner in = new Scanner(System.in);\r\n \r\n    System.out.println(\"Input number of integers to sort\");\r\n    n = in.nextInt();\r\n \r\n    int array[] = new int[n];\r\n \r\n    System.out.println(\"Enter \" + n + \" integers\");\r\n \r\n    for (c = 0; c < n; c++)\r\n      array[c] = in.nextInt();\r\n   \r\n    for (c = 0; c < ( n - 1 ); c++) {\r\n      for (d = 0; d < n - c - 1; d++) {\r\n        if (array[d] > array[d+1]) \/* For descending order use < *\/\r\n        {\r\n          swap       = array[d];\r\n          array[d]   = array[d+1];\r\n          array[d+1] = swap;\r\n        }\r\n      }\r\n    }\r\n \r\n    System.out.println(\"Sorted list of numbers:\");\r\n \r\n    for (c = 0; c < n; c++)\r\n      System.out.println(array[c]);\r\n  }\r\n}",
				"language": "Java"
			}
		}
	]
}
